package homework3.ex4;

/*      Создать класс лотерейный билет (у объекта не может быть атрибутов).
        Создать метод проверить удачу (не принимает в себя аргументов!):
        каждый десятый билет дает 100 руб,
        каждый сотый - 5_000,
        иначе 0
        Если совпало что билет одновременно десятый и сотый выбор в пользу сотого.

        Создать здесь 100 билетов, и проверить по каждому удачу.
        Итоговая сумма выигрыша после проверки удачи 110 билетов должна составить 6_000.
 */
public class LotteryTicket {
    public static void checkLuck() {
        LotteryTicket lotteryTicket = new LotteryTicket();
    }
}
